Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/unemployment_and_redundancy/redundancy/collective_redundancies.html.txt.tmx
Source language: en
Languages: ga

source: Redundancy situations generally occur where you lose your job due to circumstances such as the closure of the business or a reduction in the number of staff
ga: Go ginearálta, bíonn iomarcaíocht i gceist nuair a chailleann duine a p(h)ost de bharr gnó a bheith ag dúnadh nó laghdú a bheith ag teacht ar líon na foirne oibre

source: Redundancy may also arise due to the financial position of the firm, lack of work, re-organisation within the firm or it may be closing down completely
ga: Chomh maith leis sin, d'fhéadfadh staid airgeadais an ghnó, easpa oibre, atheagrú laistigh den ghnó nó dúnadh iomlán an ghnó a bheith mar chúis léi

source: Collective redundancies arise where, during any period of 30 consecutive days, the employees being made redundant are:
ga: Bíonn comhiomarcaíocht nuair, taobh istigh de 30 lá, a scaoiltear leis an méid seo a leanas fostaithe:

source: • 5 employees where 21-49 are employed
ga: • 5 fhostaí sa chás go bhfuil 21-49 fostaithe ann

source: • 10 employees where 50-99 are employed
ga: • 10 bhfostaí sa chás go bhfuil 50-99 fostaithe ann

source: • 10% of the employees where 100-299 are employed
ga: • 10% de na fostaithe sa chás go bhfuil 100-299 fostaithe ann

source: • 30 employees where 300 or more are employed
ga: • 30 bhfostaí sa chás go bhfuil 300 nó níos mó fostaithe ann

source: Under the Protection of Employment (Exceptional Collective Redundancies and Related Matters) Act 2007 a Redundancy Panel has been set up by the Department of Jobs, Enterprise and Innovation in accordance with the partnership agreement Towards 2016
ga: Faoin tAcht um Chaomhnú Fostaíochta (Comhiomarcaíochtaí Eisceachtúla agus Nithe Gaolmhara) 2007 (pdf) tá Panéal Iomarcaíochta bunaithe ag an Roinn Post, Fiontar agus Nuálaíochta de réir chomhaontaithe comhpháirtíochta Towards 2016

source: Some collective redundancies may be referred to the Panel to determine whether the redundancies were (or are being) carried out in order to replace the employees with workers on lower pay or other less favourable terms and conditions
ga: Is féidir roinnt iomarcaíochtaí coiteann a chur faoi bhráid an Phainéil chun cinneadh a dhéanamh an raibh (nó an bhfuil) na hiomarcaíochtaí á ndéanamh chun oibrithe ar phá níos ísle nó ar théarmaí agus coinníollacha eile nach bhfuil chomh maith a fhostú in áit na bhfostaithe sin

source: These are known as exceptional collective redundancies
ga: Tugtar iomarcaíochtaí coiteann eisceachtúla orthu seo

source: If the panel decides the redundancies were carried out for this reason, the employees concerned will be able to take action for unfair dismissal
ga: Má chinneann an painéal go ndearnadh na hiomarcaíochtaí ar an gcúis seo, beidh na fostaithe atá i gceist ábalta caingean a thógáil faoi dhífhostú éagórach

source: In such a situation, under the Protection of Employment Acts 1977-2014 your employer is obliged to enter into consultations with a view to agreement with your representatives
ga: I gcás den chineál seo, faoi na hAchtanna um Chaomhnú Fostaíochta 1977-2014, ní mór dod' fhostóir dul i mbun cainteanna d'fhonn réiteach a dhéanamh le d'ionadaithe

source: This legislation is separate from the Redundancy Payments Acts 1967–2014
ga: Is reachtaíocht leithleach é seo ó na hAchtanna um Íocaíochtaí Iomarcaíochta 1967-2014

source: These consultations must take place at the earliest opportunity and at least 30 days before the notice of redundancy is given
ga: Sa chás seo ní mór don bhfostóir dul i gcomhairle ar mhaithe le teacht ar shocrú le hionadaithe na bhfostaithe Ní mór go mbeadh na cainteanna seo ann chomh luath agus is féidir agus ar a laghad 30 lá roimh an fógra iomarcaíochta

source: The aim of the consultation is to consider whether there are any alternatives to the redundancies
ga: Is í aidhm na gcainteanna ná cinneadh a dhéanamh an bhfuil an roghanna eile leis an iomarcaíocht

source: Your employer is also obliged to provide the following information in writing to your representatives:
ga: Ní mór don bhfostóir an t-eolas seo a leanas a chur ar fáil i scríbhinn do na hionadaithe:

source: • The reasons for the redundancy
ga: • Na cúiseanna atá leis an iomarcaíocht

source: • The number and descriptions of the employees affected
ga: • Líon na bhfostaithe atá i gceist agus cur síos orthu

source: • The number and descriptions of employees normally employed
ga: • Líon na bhfostaithe atá fostaithe go hiondúil agus cur síos orthu

source: • The period in which the redundancies will happen
ga: • An tréimhse ina dtiocfaidh an iomarcaíocht i bhfeidhm

source: • The criteria for selection of employees for redundancy
ga: • An bealach ar roghnaítear fostaithe faoi leith don iomarcaíocht

source: • The method of calculating any redundancy payment
ga: • An modh oibre atá ann le haon íocaíocht iomarcaíochta a áireamh

source: Your employer is also obliged to inform the Minister for Jobs, Enterprise and Innovation in writing of the proposed redundancies at least 30 days before the occurrence of the first redundancy
ga: Ní mór dó/di é seo a dhéanamh ar a laghad 30 lá roimh an gcéad chuid de na fostaithe a scaoileadh

source: The Employees (Provision of Information and Consultation) Act 2006 requires employers to consult with employees on substantial changes in the workplace, including proposals for collective redundancies
ga: Éilíonn an tAcht um Fhostaithe (Faisnéis agus Comhchomhairle a Sholáthar) 2006 ar fhostóirí dul i gcomhairle le d’fhostaithe i dtaobh athruithe móra na láithreach oibre, lena náirítear tograí comhiomarcaíochta

source: The Act applies to employers of 50 people or more
ga: Baineann an tAcht le fhostóirí atá 50 fostaithe nó níos mó acu

source: If your employer has not complied with the requirement for a 30-day consultation process you may make a complaint that your employer has contravened Section 9 or 10 of the 1977 Act in relation to information and consultation of employees. You must use the online complaint form available on workplacerelations.ie
ga: Mura gcomhlíonann d’ fhostóir an riachtanas le próiseas comhairliúcháin 30 lá, is féidir leat gearáin faoi shárú ar ailt 9 agus 10 den Acht 1977 maidir le faisnéis agus comhairliúcháin d’ fhostaithe a dhéanamh tríd an fhoirm ghearáin ar líne nua a úsáid á fáil ar workplacerelations.ie

source: For further information about the Redundancy Payments Scheme contact the Workplace Relations Commission's Information and Customer Service
ga: Le tuilleadh faisnéise a fháil maidir leis an Scéim um Íocaíochtaí Iomarcaíochta téigh i dteagmháil leis an tSeirbhís Fhaisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre

source: You can find out about qualifying for redundancy, redundancy procedures and redundancy payments
ga: Is féidir tuilleadh a léamh faoi cháiliú le haghaidh iomarcaíochta, nósanna imeachta iomarcaíochta agus íocaíochtaí iomarcaíochta anseo

source: There is also a list of frequently asked questions about redundancy on the website of the Department of Social Protection. Further information Workplace Relations Commission Information and Customer Service O'Brien Road Carlow R93 W7W2 Ireland Opening Hours: Mon. to Fri
ga: Tá liosta ceisteanna coitianta faoi iomarcaíocht ar suíomh na Roinne Coimirce Sóisialaí
